{
  "video_url": "https://www.youtube.com/watch?v=pNrLFiJiIHs",
  "highlights": [
    {
      "id": 1,
      "title": "THE TRUTH ABOUT SINGLE MOMS",
      "start": "00:19:24.0",
      "end": "00:20:03.0",
      "duration": 39,
      "hook_category": "Truth Bomb",
      "reason": "This is a perfect 'listicle' style rant. The host lists every downside of dating a single mother (stats, ex-husband, trauma) in a continuous flow. It builds up to a strong conclusion calling men 'stupid' for ignoring the logic. 39 seconds allows the full argument to land."
    },
    {
      "id": 2,
      "title": "SOCIETY DIDN'T FORCE YOU",
      "start": "00:11:14.0",
      "end": "00:11:35.0",
      "duration": 21,
      "hook_category": "Rage Bait",
      "reason": "High-energy confrontation. The host directly attacks the lack of accountability ('Society didn't force you to sleep with a lot of guys'). It starts with a strong hook reacting to her blame-shifting and ends with a definitive insult."
    },
    {
      "id": 3,
      "title": "SIMPS CREATE ENTITLEMENT",
      "start": "00:17:52.0",
      "end": "00:18:27.0",
      "duration": 35,
      "hook_category": "Logic",
      "reason": "This segment explains the 'why' behind the behavior. It connects men's weak behavior (simping) to women's entitlement. It has a clear narrative arc: If men stopped simping -> women would vet better -> divorce would drop. Ends on a strong realization about 'baby daddies'."
    },
    {
      "id": 4,
      "title": "ACCOUNTABILITY IS KRYPTONITE",
      "start": "00:08:56.0",
      "end": "00:09:24.0",
      "duration": 28,
      "hook_category": "Truth Bomb",
      "reason": "Contrasts a woman's past behavior ('I was a hoe') with her current victimhood ('It's society's fault'). The length allows the viewer to understand exactly what she is hypocritical about before the host delivers the 'you look like a simp' punchline."
    },
    {
      "id": 5,
      "title": "SITUATIONSHIPS = OUT OF YOUR LEAGUE",
      "start": "00:22:52.0",
      "end": "00:23:15.0",
      "duration": 23,
      "hook_category": "Rage Bait",
      "reason": "A direct reality check for women complaining about 'situationships'. The host flips the script to say it's because the man is out of her league. Ends on a strong thematic summary: 'Can you see how they remove all accountability?'"
    },
    {
      "id": 6,
      "title": "MEN GAVE YOU RIGHTS",
      "start": "00:13:25.0",
      "end": "00:13:50.0",
      "duration": 25,
      "hook_category": "Controversy",
      "reason": "Extremely polarizing take on patriarchy and voting rights. By starting at 13:25, we get the context of the 'Afghanistan' comparison, leading into the host's point that men voluntarily gave up power. Guaranteed engagement driver."
    },
    {
      "id": 7,
      "title": "SINGLE MOTHERS ARE BELOW AVERAGE",
      "start": "00:02:51.0",
      "end": "00:03:15.0",
      "duration": 24,
      "hook_category": "Rage Bait",
      "reason": "One of the harshest takes in the video. He explicitly states 'she's a single mother... she's below average.' The 24s duration allows him to explain that the guy 'doesn't even remember talking to her,' proving his point about her market value."
    }
  ]
}